--- a/docs/scenarios/cash_movements.md
+++ b/docs/scenarios/cash_movements.md
@@ -45,81 +29,37 @@ Funding a portfolio requires you to perform just one, or four steps depending on
+6. The **Client Middleware** call `POST /events/deposit/` (see [here](../concepts/events.md#funding-deposit-event)).
+7. **InvestSuite** creates a notification to be sent to the client.
 
-```mermaid
-    sequenceDiagram
-
-    actor _c as Customer
-    participant _ivs as InvestSuite
-    participant _clt as Bank with<br>Client Middleware
-    participant _bc as Broker/Custodian
-    
-    _c ->> _clt: Customer funds his investor account
-    _clt ->> _bc: 1. Move cash<br>from bank's home account to<br>customer's subaccount
-    _bc -->> _clt: external_id
-    _clt ->> _ivs: 2. POST /portfolio/{id}/transactions/<br>with type: CASH_DEPOSIT,<br>status: PENDING, external_id
-    _ivs -->> _clt: id
-    _bc ->> _clt: Transaction SETTLED
-    _clt ->> _ivs: 3. PATCH /portfolio/{id}/transactions/{id}/<br>with status: SETTLED
-    _clt ->> _ivs: 4. PATCH /portfolio Holdings<br>and 4a. funded_since
-    _clt ->> _ivs: 5. POST /events/deposit
-    _ivs ->> _c: 6. Notification
+```plantuml
+    actor "Customer" as _c
+    participant "InvestSuite" as _ivs
+    participant "Bank with\nClient Middleware" as _clt
+    participant "Broker/Custodian" as _bc
+        
+    _c -> _clt: Customer funds his investor account
+    _clt -> _bc:1. Move cash\nfrom bank's home account to\ncustomer's subaccount
+    _bc --> _clt: external_id
+    _clt -> _ivs:2. POST /portfolio/{id}/transactions/ with \n- type: CASH_DEPOSIT\n- status: PENDING\n- external_id
+    _ivs --> _clt: response
+    _clt -> _clt: Store response for future use
+    _bc ->(1) _clt: Transaction SETTLED
+    _clt -> _ivs:3. PATCH /portfolio/{id}/transactions/{id}/ with \n- status: SETTLED
+    _ivs --> _clt: response
+    _clt -> _clt: Store response for future use
+    _clt -> _ivs:4. PATCH /portfolio Holdings
+    _ivs -->_clt:response
+    opt if response.funded_since == null
+    _clt -> _ivs:5. PATCH /portfolio funded_since
+    end
+    _clt -> _ivs: 5. POST /events/deposit
+    _ivs -> _c: 6. Notification
 ```
 
-
-**3. Update transaction to settled**
